class SpeechText {
  static const String speechText = '''
    敬愛なる先生、
    お手数をおかけしますが、先日の授業中に私がお休みさせていただいてしまったことを深くお詫び申し上げます。私の行動は非常に失礼であり、先生方のご尽力や教育への熱意に対して欠礼な態度を示してしまったことを心から反省しております。
    授業中に眠ってしまったことは、私自身の責任であり、他のクラスメートや先生方にも迷惑をおかけしたことを重々承知しております。教育環境は真剣に受け止めるべきものであり、私がその重要性を見落としてしまったことをお詫び申し上げます。
    今回の出来事から、私は改めて自身の学習態度と責任感に向き合うべきだと痛感しました。私は授業時間を大切にし、積極的に参加し、真剣に学ぶ姿勢を持つことを誓います。また、同様の行動を二度と繰り返さないよう自己管理を徹底して行い、信頼を回復するための努力を惜しみません。
    再度、私の不適切な行動により先生方やクラスメートにご迷惑と心配をおかけしましたことをお詫び申し上げます。今後は真摯な態度で学びに取り組み、教育環境を大切にすることを心に誓います。
    お忙しい中、このような謝罪の機会を与えていただき、心より感謝申し上げます。先生方のご指導によって私は成長することができると信じておりますので、引き続きご指導いただければ幸いです。
    改めて、深くお詫び申し上げます。
    敬具、
  ''';
}
